Revit 2027 API
BindingMap.Contains Method
 The Contains method is used to check if the parameter binding exists for one definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Contains(
	Definition key
)
Public Overrides Function Contains (
	key As Definition
) As Boolean
public:
virtual bool Contains(
	Definition^ key
) override
abstract Contains :
        key : Definition -> bool
override Contains :
        key : Definition -> bool
Parameters
key Definition
 A parameter definition which can be an existing definition or one from a shared parameters file.
Return Value
Boolean
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace